jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EMIFIF_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.57
// Version: 1

#ifndef __SI32_EMIFIF_A_REGISTERS_H__
#define __SI32_EMIFIF_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_EMIFIF_A_CONFIG_Struct
{
   union
   {
      struct
      {
         // Interface Bus Data Width
         volatile uint32_t BUSWIDTH: 1;
                  uint32_t reserved0: 1;
         // Interface Mux Mode
         volatile uint32_t MUXMD: 1;
         // Interface Automatic Address Shift Enable
         volatile uint32_t ASEN: 1;
         // Interface Read Only Enable
         volatile uint32_t ROEN: 1;
                  uint32_t reserved1: 3;
         // Write Data Hold State Inhibit
         volatile uint32_t WDHINH: 1;
                  uint32_t reserved2: 3;
         // Output Enable Delay
         volatile uint32_t DELAYOE: 1;
                  uint32_t reserved3: 3;
         // Keep Last Read Enable
         volatile uint32_t KLREN: 1;
                  uint32_t reserved4: 15;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EMIFIF_A_CONFIG_BUSWIDTH_MASK  0x00000001
#define SI32_EMIFIF_A_CONFIG_BUSWIDTH_SHIFT  0
// The data bus is 8-bits wide.
#define SI32_EMIFIF_A_CONFIG_BUSWIDTH_8BIT_VALUE  0
#define SI32_EMIFIF_A_CONFIG_BUSWIDTH_8BIT_U32 \
   (SI32_EMIFIF_A_CONFIG_BUSWIDTH_8BIT_VALUE << SI32_EMIFIF_A_CONFIG_BUSWIDTH_SHIFT)
// The data bus is 16-bits wide.
#define SI32_EMIFIF_A_CONFIG_BUSWIDTH_16BIT_VALUE  1
#define SI32_EMIFIF_A_CONFIG_BUSWIDTH_16BIT_U32 \
   (SI32_EMIFIF_A_CONFIG_BUSWIDTH_16BIT_VALUE << SI32_EMIFIF_A_CONFIG_BUSWIDTH_SHIFT)

#define SI32_EMIFIF_A_CONFIG_MUXMD_MASK  0x00000004
#define SI32_EMIFIF_A_CONFIG_MUXMD_SHIFT  2
// The interface operates in non-multiplexed mode.
#define SI32_EMIFIF_A_CONFIG_MUXMD_NONMUXED_VALUE  0
#define SI32_EMIFIF_A_CONFIG_MUXMD_NONMUXED_U32 \
   (SI32_EMIFIF_A_CONFIG_MUXMD_NONMUXED_VALUE << SI32_EMIFIF_A_CONFIG_MUXMD_SHIFT)
// The interface operates in multiplexed mode.
#define SI32_EMIFIF_A_CONFIG_MUXMD_MUXED_VALUE  1
#define SI32_EMIFIF_A_CONFIG_MUXMD_MUXED_U32 \
   (SI32_EMIFIF_A_CONFIG_MUXMD_MUXED_VALUE << SI32_EMIFIF_A_CONFIG_MUXMD_SHIFT)

#define SI32_EMIFIF_A_CONFIG_ASEN_MASK  0x00000008
#define SI32_EMIFIF_A_CONFIG_ASEN_SHIFT  3
// The address is not automatically shifted.
#define SI32_EMIFIF_A_CONFIG_ASEN_DISABLED_VALUE  0
#define SI32_EMIFIF_A_CONFIG_ASEN_DISABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_ASEN_DISABLED_VALUE << SI32_EMIFIF_A_CONFIG_ASEN_SHIFT)
// The address is automatically shifted.
#define SI32_EMIFIF_A_CONFIG_ASEN_ENABLED_VALUE  1
#define SI32_EMIFIF_A_CONFIG_ASEN_ENABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_ASEN_ENABLED_VALUE << SI32_EMIFIF_A_CONFIG_ASEN_SHIFT)

#define SI32_EMIFIF_A_CONFIG_ROEN_MASK  0x00000010
#define SI32_EMIFIF_A_CONFIG_ROEN_SHIFT  4
// The interface supports reads and writes.
#define SI32_EMIFIF_A_CONFIG_ROEN_DISABLED_VALUE  0
#define SI32_EMIFIF_A_CONFIG_ROEN_DISABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_ROEN_DISABLED_VALUE << SI32_EMIFIF_A_CONFIG_ROEN_SHIFT)
// The interface supports only reads.
#define SI32_EMIFIF_A_CONFIG_ROEN_ENABLED_VALUE  1
#define SI32_EMIFIF_A_CONFIG_ROEN_ENABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_ROEN_ENABLED_VALUE << SI32_EMIFIF_A_CONFIG_ROEN_SHIFT)

#define SI32_EMIFIF_A_CONFIG_WDHINH_MASK  0x00000100
#define SI32_EMIFIF_A_CONFIG_WDHINH_SHIFT  8
// Enable the write data hold state.
#define SI32_EMIFIF_A_CONFIG_WDHINH_INACTIVE_VALUE  0
#define SI32_EMIFIF_A_CONFIG_WDHINH_INACTIVE_U32 \
   (SI32_EMIFIF_A_CONFIG_WDHINH_INACTIVE_VALUE << SI32_EMIFIF_A_CONFIG_WDHINH_SHIFT)
// Inhibit the write data hold state.
#define SI32_EMIFIF_A_CONFIG_WDHINH_ACTIVE_VALUE  1
#define SI32_EMIFIF_A_CONFIG_WDHINH_ACTIVE_U32 \
   (SI32_EMIFIF_A_CONFIG_WDHINH_ACTIVE_VALUE << SI32_EMIFIF_A_CONFIG_WDHINH_SHIFT)

#define SI32_EMIFIF_A_CONFIG_DELAYOE_MASK  0x00001000
#define SI32_EMIFIF_A_CONFIG_DELAYOE_SHIFT  12
// The output enable signal (/OE) is not delayed.
#define SI32_EMIFIF_A_CONFIG_DELAYOE_DISABLED_VALUE  0
#define SI32_EMIFIF_A_CONFIG_DELAYOE_DISABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_DELAYOE_DISABLED_VALUE << SI32_EMIFIF_A_CONFIG_DELAYOE_SHIFT)
// The output enable signal (/OE) is delayed.
#define SI32_EMIFIF_A_CONFIG_DELAYOE_ENABLED_VALUE  1
#define SI32_EMIFIF_A_CONFIG_DELAYOE_ENABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_DELAYOE_ENABLED_VALUE << SI32_EMIFIF_A_CONFIG_DELAYOE_SHIFT)

#define SI32_EMIFIF_A_CONFIG_KLREN_MASK  0x00010000
#define SI32_EMIFIF_A_CONFIG_KLREN_SHIFT  16
// The bus is driven to the idle state between active requests.
#define SI32_EMIFIF_A_CONFIG_KLREN_DISABLED_VALUE  0
#define SI32_EMIFIF_A_CONFIG_KLREN_DISABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_KLREN_DISABLED_VALUE << SI32_EMIFIF_A_CONFIG_KLREN_SHIFT)
// The bus drives the last value read on the interface between active requests.
#define SI32_EMIFIF_A_CONFIG_KLREN_ENABLED_VALUE  1
#define SI32_EMIFIF_A_CONFIG_KLREN_ENABLED_U32 \
   (SI32_EMIFIF_A_CONFIG_KLREN_ENABLED_VALUE << SI32_EMIFIF_A_CONFIG_KLREN_SHIFT)



struct SI32_EMIFIF_A_IFRT_Struct
{
   union
   {
      struct
      {
         // Interface Read Address Setup Delay
         volatile uint32_t RASET: 4;
         // Interface Read Address Hold Delay
         volatile uint32_t RAHOLD: 4;
         // Interface Read Data Hold Delay
         volatile uint32_t RDHOLD: 4;
                  uint32_t reserved0: 4;
         // Interface Read Data Wait Delay
         volatile uint32_t RDWAIT: 6;
                  uint32_t reserved1: 10;
      };
      volatile uint32_t U32;
   };
};

