jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EMIFIF_A_Registers.h
#define SI32_EMIFIF_A_IFRT_RASET_MASK  0x0000000F
#define SI32_EMIFIF_A_IFRT_RASET_SHIFT  0

#define SI32_EMIFIF_A_IFRT_RAHOLD_MASK  0x000000F0
#define SI32_EMIFIF_A_IFRT_RAHOLD_SHIFT  4

#define SI32_EMIFIF_A_IFRT_RDHOLD_MASK  0x00000F00
#define SI32_EMIFIF_A_IFRT_RDHOLD_SHIFT  8

#define SI32_EMIFIF_A_IFRT_RDWAIT_MASK  0x003F0000
#define SI32_EMIFIF_A_IFRT_RDWAIT_SHIFT  16



struct SI32_EMIFIF_A_IFWT_Struct
{
   union
   {
      struct
      {
         // Interface Write Address Setup Delay
         volatile uint32_t WASET: 4;
         // Interface Write Address Hold Delay
         volatile uint32_t WAHOLD: 4;
         // Interface Write Data Hold Delay
         volatile uint32_t WDHOLD: 4;
                  uint32_t reserved0: 4;
         // Interface Write Data Wait Delay
         volatile uint32_t WDWAIT: 6;
                  uint32_t reserved1: 10;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EMIFIF_A_IFWT_WASET_MASK  0x0000000F
#define SI32_EMIFIF_A_IFWT_WASET_SHIFT  0

#define SI32_EMIFIF_A_IFWT_WAHOLD_MASK  0x000000F0
#define SI32_EMIFIF_A_IFWT_WAHOLD_SHIFT  4

#define SI32_EMIFIF_A_IFWT_WDHOLD_MASK  0x00000F00
#define SI32_EMIFIF_A_IFWT_WDHOLD_SHIFT  8

#define SI32_EMIFIF_A_IFWT_WDWAIT_MASK  0x003F0000
#define SI32_EMIFIF_A_IFWT_WDWAIT_SHIFT  16



struct SI32_EMIFIF_A_IFRCST_Struct
{
   union
   {
      struct
      {
         // Chip Select Read Address Setup State
         volatile uint32_t CSRAS: 1;
         // Chip Select Read Address Hold State
         volatile uint32_t CSRAH: 1;
         // Chip Select Read Data Wait State
         volatile uint32_t CSRDW: 1;
         // Chip Select Read Data Hold State
         volatile uint32_t CSRDH: 1;
         // Output Enable Read Address Setup State
         volatile uint32_t OERAS: 1;
         // Output Enable Read Address Hold State
         volatile uint32_t OERAH: 1;
         // Output Enable Read Data Wait State
         volatile uint32_t OERDW: 1;
         // Output Enable Read Data Hold State
         volatile uint32_t OERDH: 1;
         // Write Signal Read Address Setup State
         volatile uint32_t WRRAS: 1;
         // Write Signal Read Address Hold State
         volatile uint32_t WRRAH: 1;
         // Write Signal Read Data Wait State
         volatile uint32_t WRRDW: 1;
         // Write Signal Read Data Hold State
         volatile uint32_t WRRDH: 1;
         // Address Latch Enable Read Address Setup State
         volatile uint32_t ALERAS: 1;
         // Address Latch Enable Read Address Hold State
         volatile uint32_t ALERAH: 1;
         // Address Latch Enable Read Data Wait State
         volatile uint32_t ALERDW: 1;
         // Address Latch Enable Read Data Hold State
         volatile uint32_t ALERDH: 1;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EMIFIF_A_IFRCST_CSRAS_MASK  0x00000001
#define SI32_EMIFIF_A_IFRCST_CSRAS_SHIFT  0
// Set chip select (CSx) to low during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_CSRAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_CSRAS_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRAS_LOW_VALUE << SI32_EMIFIF_A_IFRCST_CSRAS_SHIFT)
// Set chip select (CSx) to high during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_CSRAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_CSRAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRAS_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_CSRAS_SHIFT)

#define SI32_EMIFIF_A_IFRCST_CSRAH_MASK  0x00000002
#define SI32_EMIFIF_A_IFRCST_CSRAH_SHIFT  1
// Set chip select (CSx) to low during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_CSRAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_CSRAH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRAH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_CSRAH_SHIFT)
// Set chip select (CSx) to high during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_CSRAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_CSRAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRAH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_CSRAH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_CSRDW_MASK  0x00000004
#define SI32_EMIFIF_A_IFRCST_CSRDW_SHIFT  2
// Set chip select (CSx) to low during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_CSRDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_CSRDW_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRDW_LOW_VALUE << SI32_EMIFIF_A_IFRCST_CSRDW_SHIFT)
// Set chip select (CSx) to high during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_CSRDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_CSRDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRDW_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_CSRDW_SHIFT)

#define SI32_EMIFIF_A_IFRCST_CSRDH_MASK  0x00000008
#define SI32_EMIFIF_A_IFRCST_CSRDH_SHIFT  3
// Set chip select (CSx) to low during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_CSRDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_CSRDH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRDH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_CSRDH_SHIFT)
// Set chip select (CSx) to high during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_CSRDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_CSRDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_CSRDH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_CSRDH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_OERAS_MASK  0x00000010
#define SI32_EMIFIF_A_IFRCST_OERAS_SHIFT  4
// Set output enable (/OE) to low during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_OERAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_OERAS_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_OERAS_LOW_VALUE << SI32_EMIFIF_A_IFRCST_OERAS_SHIFT)
// Set output enable (/OE) to high during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_OERAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_OERAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_OERAS_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_OERAS_SHIFT)

#define SI32_EMIFIF_A_IFRCST_OERAH_MASK  0x00000020
#define SI32_EMIFIF_A_IFRCST_OERAH_SHIFT  5
// Set output enable (/OE) to low during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_OERAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_OERAH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_OERAH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_OERAH_SHIFT)
// Set output enable (/OE) to high during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_OERAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_OERAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_OERAH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_OERAH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_OERDW_MASK  0x00000040
#define SI32_EMIFIF_A_IFRCST_OERDW_SHIFT  6
// Set output enable (/OE) to low during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_OERDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_OERDW_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_OERDW_LOW_VALUE << SI32_EMIFIF_A_IFRCST_OERDW_SHIFT)
// Set output enable (/OE) to high during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_OERDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_OERDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_OERDW_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_OERDW_SHIFT)

#define SI32_EMIFIF_A_IFRCST_OERDH_MASK  0x00000080
#define SI32_EMIFIF_A_IFRCST_OERDH_SHIFT  7
// Set output enable (/OE) to low during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_OERDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_OERDH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_OERDH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_OERDH_SHIFT)
// Set output enable (/OE) to high during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_OERDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_OERDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_OERDH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_OERDH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_WRRAS_MASK  0x00000100
#define SI32_EMIFIF_A_IFRCST_WRRAS_SHIFT  8
// Set write signal (/WR) to low during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_WRRAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_WRRAS_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRAS_LOW_VALUE << SI32_EMIFIF_A_IFRCST_WRRAS_SHIFT)
// Set write signal (/WR) to high during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_WRRAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_WRRAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRAS_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_WRRAS_SHIFT)

