jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EMIFIF_A_Registers.h
#define SI32_EMIFIF_A_IFRCST_WRRAH_MASK  0x00000200
#define SI32_EMIFIF_A_IFRCST_WRRAH_SHIFT  9
// Set write signal (/WR) to low during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_WRRAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_WRRAH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRAH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_WRRAH_SHIFT)
// Set write signal (/WR) to high during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_WRRAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_WRRAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRAH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_WRRAH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_WRRDW_MASK  0x00000400
#define SI32_EMIFIF_A_IFRCST_WRRDW_SHIFT  10
// Set write signal (/WR) to low during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_WRRDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_WRRDW_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRDW_LOW_VALUE << SI32_EMIFIF_A_IFRCST_WRRDW_SHIFT)
// Set write signal (/WR) to high during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_WRRDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_WRRDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRDW_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_WRRDW_SHIFT)

#define SI32_EMIFIF_A_IFRCST_WRRDH_MASK  0x00000800
#define SI32_EMIFIF_A_IFRCST_WRRDH_SHIFT  11
// Set write signal (/WR) to low during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_WRRDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_WRRDH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRDH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_WRRDH_SHIFT)
// Set write signal (/WR) to high during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_WRRDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_WRRDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_WRRDH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_WRRDH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_ALERAS_MASK  0x00001000
#define SI32_EMIFIF_A_IFRCST_ALERAS_SHIFT  12
// Set address latch enable (ALEm) to low during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_ALERAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_ALERAS_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERAS_LOW_VALUE << SI32_EMIFIF_A_IFRCST_ALERAS_SHIFT)
// Set address latch enable (ALEm) to high during the read address setup state.
#define SI32_EMIFIF_A_IFRCST_ALERAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_ALERAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERAS_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_ALERAS_SHIFT)

#define SI32_EMIFIF_A_IFRCST_ALERAH_MASK  0x00002000
#define SI32_EMIFIF_A_IFRCST_ALERAH_SHIFT  13
// Set address latch enable (ALEm) to low during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_ALERAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_ALERAH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERAH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_ALERAH_SHIFT)
// Set address latch enable (ALEm) to high during the read address hold state.
#define SI32_EMIFIF_A_IFRCST_ALERAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_ALERAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERAH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_ALERAH_SHIFT)

#define SI32_EMIFIF_A_IFRCST_ALERDW_MASK  0x00004000
#define SI32_EMIFIF_A_IFRCST_ALERDW_SHIFT  14
// Set address latch enable (ALEm) to low during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_ALERDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_ALERDW_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERDW_LOW_VALUE << SI32_EMIFIF_A_IFRCST_ALERDW_SHIFT)
// Set address latch enable (ALEm) to high during the read data wait state.
#define SI32_EMIFIF_A_IFRCST_ALERDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_ALERDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERDW_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_ALERDW_SHIFT)

#define SI32_EMIFIF_A_IFRCST_ALERDH_MASK  0x00008000
#define SI32_EMIFIF_A_IFRCST_ALERDH_SHIFT  15
// Set address latch enable (ALEm) to low during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_ALERDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFRCST_ALERDH_LOW_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERDH_LOW_VALUE << SI32_EMIFIF_A_IFRCST_ALERDH_SHIFT)
// Set address latch enable (ALEm) to high during the read data hold state.
#define SI32_EMIFIF_A_IFRCST_ALERDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFRCST_ALERDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFRCST_ALERDH_HIGH_VALUE << SI32_EMIFIF_A_IFRCST_ALERDH_SHIFT)



struct SI32_EMIFIF_A_IFWCST_Struct
{
   union
   {
      struct
      {
         // Chip Select Write Address Setup State
         volatile uint32_t CSWAS: 1;
         // Chip Select Write Address Hold State
         volatile uint32_t CSWAH: 1;
         // Chip Select Write Data Wait State
         volatile uint32_t CSWDW: 1;
         // Chip Select Write Data Hold State
         volatile uint32_t CSWDH: 1;
         // Output Enable Write Address Setup State
         volatile uint32_t OEWAS: 1;
         // Output Enable Write Address Hold State
         volatile uint32_t OEWAH: 1;
         // Output Enable Write Data Wait State
         volatile uint32_t OEWDW: 1;
         // Output Enable Write Data Hold State
         volatile uint32_t OEWDH: 1;
         // Write Signal Write Address Setup State
         volatile uint32_t WRWAS: 1;
         // Write Signal Write Address Hold State
         volatile uint32_t WRWAH: 1;
         // Write Signal Write Data Wait State
         volatile uint32_t WRWDW: 1;
         // Write Signal Write Data Hold State
         volatile uint32_t WRWDH: 1;
         // Address Latch Enable Write Address Setup State
         volatile uint32_t ALEWAS: 1;
         // Address Latch Enable Write Address Hold State
         volatile uint32_t ALEWAH: 1;
         // Address Latch Enable Write Data Wait State
         volatile uint32_t ALEWDW: 1;
         // Address Latch Enable Write Data Hold State
         volatile uint32_t ALEWDH: 1;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_EMIFIF_A_IFWCST_CSWAS_MASK  0x00000001
#define SI32_EMIFIF_A_IFWCST_CSWAS_SHIFT  0
// Set chip select (CSx) to low during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_CSWAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_CSWAS_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWAS_LOW_VALUE << SI32_EMIFIF_A_IFWCST_CSWAS_SHIFT)
// Set chip select (CSx) to high during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_CSWAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_CSWAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWAS_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_CSWAS_SHIFT)

#define SI32_EMIFIF_A_IFWCST_CSWAH_MASK  0x00000002
#define SI32_EMIFIF_A_IFWCST_CSWAH_SHIFT  1
// Set chip select (CSx) to low during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_CSWAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_CSWAH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWAH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_CSWAH_SHIFT)
// Set chip select (CSx) to high during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_CSWAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_CSWAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWAH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_CSWAH_SHIFT)

#define SI32_EMIFIF_A_IFWCST_CSWDW_MASK  0x00000004
#define SI32_EMIFIF_A_IFWCST_CSWDW_SHIFT  2
// Set chip select (CSx) to low during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_CSWDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_CSWDW_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWDW_LOW_VALUE << SI32_EMIFIF_A_IFWCST_CSWDW_SHIFT)
// Set chip select (CSx) to high during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_CSWDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_CSWDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWDW_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_CSWDW_SHIFT)

#define SI32_EMIFIF_A_IFWCST_CSWDH_MASK  0x00000008
#define SI32_EMIFIF_A_IFWCST_CSWDH_SHIFT  3
// Set chip select (CSx) to low during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_CSWDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_CSWDH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWDH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_CSWDH_SHIFT)
// Set chip select (CSx) to high during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_CSWDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_CSWDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_CSWDH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_CSWDH_SHIFT)

#define SI32_EMIFIF_A_IFWCST_OEWAS_MASK  0x00000010
#define SI32_EMIFIF_A_IFWCST_OEWAS_SHIFT  4
// Set output enable (/OE) to low during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_OEWAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_OEWAS_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWAS_LOW_VALUE << SI32_EMIFIF_A_IFWCST_OEWAS_SHIFT)
// Set output enable (/OE) to high during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_OEWAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_OEWAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWAS_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_OEWAS_SHIFT)

#define SI32_EMIFIF_A_IFWCST_OEWAH_MASK  0x00000020
#define SI32_EMIFIF_A_IFWCST_OEWAH_SHIFT  5
// Set output enable (/OE) to low during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_OEWAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_OEWAH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWAH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_OEWAH_SHIFT)
// Set output enable (/OE) to high during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_OEWAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_OEWAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWAH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_OEWAH_SHIFT)

#define SI32_EMIFIF_A_IFWCST_OEWDW_MASK  0x00000040
#define SI32_EMIFIF_A_IFWCST_OEWDW_SHIFT  6
// Set output enable (/OE) to low during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_OEWDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_OEWDW_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWDW_LOW_VALUE << SI32_EMIFIF_A_IFWCST_OEWDW_SHIFT)
// Set output enable (/OE) to high during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_OEWDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_OEWDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWDW_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_OEWDW_SHIFT)

#define SI32_EMIFIF_A_IFWCST_OEWDH_MASK  0x00000080
#define SI32_EMIFIF_A_IFWCST_OEWDH_SHIFT  7
// Set output enable (/OE) to low during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_OEWDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_OEWDH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWDH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_OEWDH_SHIFT)
// Set output enable (/OE) to high during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_OEWDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_OEWDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_OEWDH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_OEWDH_SHIFT)

