jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_EMIFIF_A_Registers.h
#define SI32_EMIFIF_A_IFWCST_WRWAS_MASK  0x00000100
#define SI32_EMIFIF_A_IFWCST_WRWAS_SHIFT  8
// Set write signal (/WR) to low during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_WRWAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_WRWAS_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWAS_LOW_VALUE << SI32_EMIFIF_A_IFWCST_WRWAS_SHIFT)
// Set write signal (/WR) to high during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_WRWAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_WRWAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWAS_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_WRWAS_SHIFT)

#define SI32_EMIFIF_A_IFWCST_WRWAH_MASK  0x00000200
#define SI32_EMIFIF_A_IFWCST_WRWAH_SHIFT  9
// Set write signal (/WR) to low during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_WRWAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_WRWAH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWAH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_WRWAH_SHIFT)
// Set write signal (/WR) to high during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_WRWAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_WRWAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWAH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_WRWAH_SHIFT)

#define SI32_EMIFIF_A_IFWCST_WRWDW_MASK  0x00000400
#define SI32_EMIFIF_A_IFWCST_WRWDW_SHIFT  10
// Set write signal (/WR) to low during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_WRWDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_WRWDW_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWDW_LOW_VALUE << SI32_EMIFIF_A_IFWCST_WRWDW_SHIFT)
// Set write signal (/WR) to high during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_WRWDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_WRWDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWDW_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_WRWDW_SHIFT)

#define SI32_EMIFIF_A_IFWCST_WRWDH_MASK  0x00000800
#define SI32_EMIFIF_A_IFWCST_WRWDH_SHIFT  11
// Set write signal (/WR) to low during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_WRWDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_WRWDH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWDH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_WRWDH_SHIFT)
// Set write signal (/WR) to high during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_WRWDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_WRWDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_WRWDH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_WRWDH_SHIFT)

#define SI32_EMIFIF_A_IFWCST_ALEWAS_MASK  0x00001000
#define SI32_EMIFIF_A_IFWCST_ALEWAS_SHIFT  12
// Set address latch enable (ALEm) to low during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_ALEWAS_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_ALEWAS_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWAS_LOW_VALUE << SI32_EMIFIF_A_IFWCST_ALEWAS_SHIFT)
// Set address latch enable (ALEm) to high during the write address setup state.
#define SI32_EMIFIF_A_IFWCST_ALEWAS_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_ALEWAS_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWAS_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_ALEWAS_SHIFT)

#define SI32_EMIFIF_A_IFWCST_ALEWAH_MASK  0x00002000
#define SI32_EMIFIF_A_IFWCST_ALEWAH_SHIFT  13
// Set address latch enable (ALEm) to low during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_ALEWAH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_ALEWAH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWAH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_ALEWAH_SHIFT)
// Set address latch enable (ALEm) to high during the write address hold state.
#define SI32_EMIFIF_A_IFWCST_ALEWAH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_ALEWAH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWAH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_ALEWAH_SHIFT)

#define SI32_EMIFIF_A_IFWCST_ALEWDW_MASK  0x00004000
#define SI32_EMIFIF_A_IFWCST_ALEWDW_SHIFT  14
// Set address latch enable (ALEm) to low during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_ALEWDW_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_ALEWDW_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWDW_LOW_VALUE << SI32_EMIFIF_A_IFWCST_ALEWDW_SHIFT)
// Set address latch enable (ALEm) to high during the write data wait state.
#define SI32_EMIFIF_A_IFWCST_ALEWDW_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_ALEWDW_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWDW_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_ALEWDW_SHIFT)

#define SI32_EMIFIF_A_IFWCST_ALEWDH_MASK  0x00008000
#define SI32_EMIFIF_A_IFWCST_ALEWDH_SHIFT  15
// Set address latch enable (ALEm) to low during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_ALEWDH_LOW_VALUE  0
#define SI32_EMIFIF_A_IFWCST_ALEWDH_LOW_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWDH_LOW_VALUE << SI32_EMIFIF_A_IFWCST_ALEWDH_SHIFT)
// Set address latch enable (ALEm) to high during the write data hold state.
#define SI32_EMIFIF_A_IFWCST_ALEWDH_HIGH_VALUE  1
#define SI32_EMIFIF_A_IFWCST_ALEWDH_HIGH_U32 \
   (SI32_EMIFIF_A_IFWCST_ALEWDH_HIGH_VALUE << SI32_EMIFIF_A_IFWCST_ALEWDH_SHIFT)



typedef struct SI32_EMIFIF_A_Struct
{
   struct SI32_EMIFIF_A_CONFIG_Struct              CONFIG         ; // Base Address + 0x0
   volatile uint32_t                               CONFIG_SET;
   volatile uint32_t                               CONFIG_CLR;
   uint32_t                                        reserved0;
   struct SI32_EMIFIF_A_IFRT_Struct                IFRT           ; // Base Address + 0x10
   uint32_t                                        reserved1;
   uint32_t                                        reserved2;
   uint32_t                                        reserved3;
   struct SI32_EMIFIF_A_IFWT_Struct                IFWT           ; // Base Address + 0x20
   uint32_t                                        reserved4;
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   struct SI32_EMIFIF_A_IFRCST_Struct              IFRCST         ; // Base Address + 0x30
   uint32_t                                        reserved7;
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   struct SI32_EMIFIF_A_IFWCST_Struct              IFWCST         ; // Base Address + 0x40
   uint32_t                                        reserved10;
   uint32_t                                        reserved11;
   uint32_t                                        reserved12;
} SI32_EMIFIF_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_EMIFIF_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

